index.org
#+TITLE: A Magic Dwells in Each Beginning
#+DATE: <2020-09-08>
#+SUBTITLE: Blog Index
#+LANGUAGE: en
#+DESCRIPTION: The journey of a notorious noob.
#+KEYWORDS: learn programming, coding projects, novice programmer, beginner
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io">
#+SETUPFILE: ../monkeyjunglejuice/static/setup.org
#+OPTIONS: toc:1

* Projects

#+ATTR_HTML: :class index
#+begin_nav
|   | Protoverse: Building An Artificial Universe from Scratch |
|---+----------------------------------------------------------|
|   | [[file:blog/artificial-universe-introduction.project.org][Introduction]]                                             |
|   | [[file:blog/artificial-universe-metaphysics.project.org][Metaphysical Framework]]                                   |
|   | [[file:blog/artificial-universe-engineering.project.org][Technical Considerations]]                                 |
|   | [[file:blog/artificial-universe-ethics.project.org][Ethical Guidelines]]                                       |
#+end_nav

* Essays

#+ATTR_HTML: :class index
#+begin_nav
|   | Opinions for Free                                |
|---+--------------------------------------------------|
|   | [[file:blog/best-programming-language-for-beginner.essay.org][Which Programming Language Should I Learn First?]] |
#+end_nav

* Code Walkthroughs

#+ATTR_HTML: :class index
#+begin_nav
|    | Beginner's Project »GTK Theme Switcher«           |
|----+---------------------------------------------------|
| 1. | [[file:blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org][Let's code a GTK Theme Switcher for XFCE in OCaml]] |
| 2. | [[file:blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org][Config File Parsing in OCaml]] [unfinished]         |
#+end_nav

#+ATTR_HTML: :class index
#+begin_nav
|    | Beginner's Project »CSV Cleaner«           |
|----+--------------------------------------------|
| 1. | [[file:blog/learning-to-code-first-app-episode-1.tutorial.org][Manipulating CSV Files in Common Lisp]]      |
| 2. | [[file:blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org][Rewriting CSV Cleaner in OCaml]]             |
| 3. | [[file:blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org][Eat my Huge Files: Tail Recursion in OCaml]] |
#+end_nav

* How-Tos

#+ATTR_HTML: :class index
#+begin_nav
|   | Knowledge You Can't Live Without                        |
|---+---------------------------------------------------------|
|   | [[file:blog/emacs-server-name-frame-title.howto.org][How to Display the Emacs Server Name in the Frame Title]] |
#+end_nav

* Bio

Hi, Dan here! Welcome to my personal blog, where I track some aspects of my journey and share the findings along the way. I've got a love for examining phenomena from various perspectives and a deep fascination with things 'bottom-up'.

I’m a designer, entrepreneur, and co-founder of a footwear brand. Before embracing entrepreneurship, I specialized in conversion rate optimization, a field I found thrilling for its empirical approach to dissecting human decision-making and persuasion.

When I'm not sitting on my butt --- which has become a more common occurrence recently --- I'm throwing elbows and knees in Muay Thai, shredding the streets on my old-school skateboard, taking strolls along the beach, or listening to the wind in the leaves.

-----

#+begin_center
CREDITS
Static blog generator: [[https://www.gnu.org/software/emacs/][Emacs]] with [[https://orgmode.org/features.html#publishing][Org-mode]]
CSS frameworks: [[http://necolas.github.io/normalize.css/][normalize.css]] and [[https://github.com/oxalorg/sakura][sakura]]
#+end_center
