index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-06 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Magic Dwells in Each Beginning</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="The journey of a notorious noob." />
<meta name="keywords" content="learn programming, coding projects, novice programmer, beginner" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; img-src 'self' https://*; media-src 'self' https://*;">
<meta name="google-site-verification" content="WUje0h1DXIUXINogHFZva1zk3Lw1oSpgrqva9dubYq0">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/mononoki/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">A Magic Dwells in Each Beginning</h1>
<p class="subtitle" role="doc-subtitle">Blog Index</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc23f22">Projects</a></li>
<li><a href="#org5aa89ed">Essays</a></li>
<li><a href="#orgc0c5df9">Code Walkthroughs</a></li>
<li><a href="#org5b6a8a4">How-Tos</a></li>
<li><a href="#orgc126c08">Bio</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgcc23f22" class="outline-2">
<h2 id="orgcc23f22"><a href="#orgcc23f22">Projects</a></h2>
<div class="outline-text-2" id="text-orgcc23f22">
<nav class="index" id="org165f793">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Protoverse: Building An Artificial Universe from Scratch</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="blog/artificial-universe-introduction.project.html">Introduction</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="blog/artificial-universe-metaphysics.project.html">Metaphysical Framework</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="blog/artificial-universe-engineering.project.html">Technical Considerations</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="blog/artificial-universe-ethics.project.html">Ethical Guidelines</a></td>
</tr>
</tbody>
</table>
</nav>
</div>
</div>

<div id="outline-container-org5aa89ed" class="outline-2">
<h2 id="org5aa89ed"><a href="#org5aa89ed">Essays</a></h2>
<div class="outline-text-2" id="text-org5aa89ed">
<nav class="index" id="orgc4d552f">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Opinions for Free</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="blog/best-programming-language-for-beginner.essay.html">Which Programming Language Should I Learn First?</a></td>
</tr>
</tbody>
</table>
</nav>
</div>
</div>

<div id="outline-container-orgc0c5df9" class="outline-2">
<h2 id="orgc0c5df9"><a href="#orgc0c5df9">Code Walkthroughs</a></h2>
<div class="outline-text-2" id="text-orgc0c5df9">
<nav class="index" id="orgc89886f">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">Beginner&rsquo;s Project »GTK Theme Switcher«</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1.</td>
<td class="org-left"><a href="blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html">Let&rsquo;s code a GTK Theme Switcher for XFCE in OCaml</a></td>
</tr>

<tr>
<td class="org-right">2.</td>
<td class="org-left"><a href="blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html">Config File Parsing in OCaml</a> [unfinished]</td>
</tr>
</tbody>
</table>
</nav>

<nav class="index" id="org054e6ec">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">Beginner&rsquo;s Project »CSV Cleaner«</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1.</td>
<td class="org-left"><a href="blog/learning-to-code-first-app-episode-1.tutorial.html">Manipulating CSV Files in Common Lisp</a></td>
</tr>

<tr>
<td class="org-right">2.</td>
<td class="org-left"><a href="blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html">Rewriting CSV Cleaner in OCaml</a></td>
</tr>

<tr>
<td class="org-right">3.</td>
<td class="org-left"><a href="blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">Eat my Huge Files: Tail Recursion in OCaml</a></td>
</tr>
</tbody>
</table>
</nav>
</div>
</div>

<div id="outline-container-org5b6a8a4" class="outline-2">
<h2 id="org5b6a8a4"><a href="#org5b6a8a4">How-Tos</a></h2>
<div class="outline-text-2" id="text-org5b6a8a4">
<nav class="index" id="orgf6e49fd">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Knowledge You Can&rsquo;t Live Without</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="blog/emacs-server-name-frame-title.howto.html">How to Display the Emacs Server Name in the Frame Title</a></td>
</tr>
</tbody>
</table>
</nav>
</div>
</div>

<div id="outline-container-orgc126c08" class="outline-2">
<h2 id="orgc126c08"><a href="#orgc126c08">Bio</a></h2>
<div class="outline-text-2" id="text-orgc126c08">
<p>
Hi, Dan here! Welcome to my personal blog, where I track some aspects of my journey and share the findings along the way. I&rsquo;ve got a love for examining phenomena from various perspectives and a deep fascination with things &rsquo;bottom-up&rsquo;.<br>
</p>

<p>
I’m a designer, entrepreneur, and co-founder of a footwear brand. Before embracing entrepreneurship, I specialized in conversion rate optimization, a field I found thrilling for its empirical approach to dissecting human decision-making and persuasion.<br>
</p>

<p>
When I&rsquo;m not sitting on my butt &#x2014; which has become a more common occurrence recently &#x2014; I&rsquo;m throwing elbows and knees in Muay Thai, shredding the streets on my old-school skateboard, taking strolls along the beach, or listening to the wind in the leaves.<br>
</p>

<hr>

<div class="org-center">
<p>
CREDITS<br>
Static blog generator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> with <a href="https://orgmode.org/features.html#publishing">Org-mode</a><br>
CSS frameworks: <a href="http://necolas.github.io/normalize.css/">normalize.css</a> and <a href="https://github.com/oxalorg/sakura">sakura</a><br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author">Dan Dee</span> <span class="email"><a href="mailto:MonkeyJungleJuice@pm.me">MonkeyJungleJuice@pm.me</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
